# FabricationPartDepthInOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationPartDepthInOption Property
ParameterTypeId Class See Also
---
"Main Primary Depth Option"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationPartDepthInOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartDepthInOption As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationPartDepthInOption {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace